app/controllers/bakers_controller.rb

SELECT "bakers".* FROM "bakers" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @bakers = Baker.all