app/controllers/bakers_controller.rb

SELECT "bakers".* FROM "bakers" WHERE "bakers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def logged_in
    baker = Baker.find_by(id: session[:baker_id])

SELECT "bakers".* FROM "bakers" WHERE "bakers"."email" = $1 LIMIT $2  [["email", "jaynasimiyu@gmail.com"], ["LIMIT", 1]]
---
  def account_recovery
    baker = Baker.find_by(email: params[:email])

SELECT "bakers".* FROM "bakers"
---
  def index
    @bakers = Baker.all