app/controllers/carts_controller.rb

INSERT INTO "carts" ("customer_id", "total", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["customer_id", 2], ["total", 0.0], ["active", true], ["created_at", "2023-07-01 09:57:07.396121"], ["updated_at", "2023-07-01 09:57:07.396121"]]
---
  def create
    @cart = Cart.new(cart_params)

    if @cart.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_cart
      @cart = Cart.find(params[:id])