app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @customers = Customer.all

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_customer
      @customer = Customer.find(params[:id])