app/controllers/customers_controller.rb

  def account_recovery
    customer = Customer.find_by(email: params[:email])
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = $1 LIMIT $2  [["email", "odudigbopascal@gmail.com"], ["LIMIT", 1]]

  def index
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def create
    @customer = Customer.new(customer_params)

    if @customer.save
---
INSERT INTO "customers" ("first_name", "last_name", "email", "verified", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]