app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def logged_in
    customer = Customer.find_by(id: session[:customer_id])

SELECT "customers".* FROM "customers"
---
  def index
    @customers = Customer.all

INSERT INTO "customers" ("first_name", "last_name", "email", "verified", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @customer = Customer.new(customer_params)

    if @customer.save

UPDATE "customers" SET "verified" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["verified", true], ["updated_at", "2023-05-07 20:31:55.071537"], ["id", 1]]
---
  def update
    if @customer.update(customer_params)

DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 1]]
---
  def destroy
    @customer.destroy

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_customer
      @customer = Customer.find(params[:id])