app/controllers/customer_addresses_controller.rb

  def create
    @customer_address = CustomerAddress.new(customer_address_params)

    if @customer_address.save
---
INSERT INTO "customer_addresses" ("customer_id", "phone", "address", "aditional_information", "region", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @customer_address.update(customer_address_params)
---
UPDATE "customer_addresses" SET "aditional_information" = $1, "updated_at" = $2 WHERE "customer_addresses"."id" = $3  [["aditional_information", "Test2"], ["updated_at", "2023-07-03 20:34:02.781238"], ["id", 1]]

  def destroy
    @customer_address.destroy
---
DELETE FROM "customer_addresses" WHERE "customer_addresses"."id" = $1  [["id", 6]]

    def set_customer_address
      @customer_address = CustomerAddress.find(params[:id])
---
SELECT "customer_addresses".* FROM "customer_addresses" WHERE "customer_addresses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]