app/controllers/discounts_controller.rb

  def index
    @discounts = Discount.all
---
SELECT "discounts".* FROM "discounts"

    def set_discount
      @discount = Discount.find(params[:id])
---
SELECT "discounts".* FROM "discounts" WHERE "discounts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]