app/controllers/product_images_controller.rb

SELECT "product_images".* FROM "product_images"
---
  def index
    @product_images = ProductImage.all

INSERT INTO "product_images" ("product_id", "image_url", "image_public_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @product_image = ProductImage.new(product_image_params)

    if @product_image.save

DELETE FROM "product_images" WHERE "product_images"."id" = $1  [["id", 1]]
---
  def destroy
    @product_image.destroy

SELECT "product_images".* FROM "product_images" WHERE "product_images"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_product_image
      @product_image = ProductImage.find(params[:id])