app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "price", "description", "discount_id", "variant_group_id", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "description" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["description", "test blaa blaa blaa raa raa bllooofhcg, grauuuouog, ytdtgfctgf"], ["updated_at", "2023-07-03 01:56:57.721751"], ["id", 7]]

  def destroy
    @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 5]]

    def set_product
      @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]