app/controllers/variant_options_controller.rb

SELECT "variant_options".* FROM "variant_options"
---
  def index
    @variant_options = VariantOption.all