app/controllers/variant_groups_controller.rb

  def index
    @variant_groups = VariantGroup.all
---
SELECT "variant_groups".* FROM "variant_groups"

    def set_variant_group
      @variant_group = VariantGroup.find(params[:id])
---
SELECT "variant_groups".* FROM "variant_groups" WHERE "variant_groups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]